#version: 0.2
C 1
C (
= O
= C
=O )
= N
C C
C( =O)
C C1
N 1
# N
= C1
N C1
C #N
C 2
= C(
=C N
O C1
C =N
) C#N
N =C1
O =C1
C N1
C =O
O 1
C C(
=C C(=O)
C =O)
CC #N
N )
N =N
C =C1
O )
=C N1
C1 =O
C )
N C(=O)
CC 2
C( =N
C O
C#N )
C NC1
C =C
N #
C N
O =C
C(=O) N1
C(=N )
CC1 (
NC1 =N
C #
CC C1
N=C1 N
C C(=O)
C OC1
CC1 =N
CC1 =C(
C( N)
NC1 =CC(=O)
C 3
N =C
NC1 =C
N (
O C(=O)
O=C1 N
N=N 1
F )
CC1 2
C =C(
O=C1 O
O=C C1
NC1 =C(
C( O)
CC #
CC1 =CN
NC1 =CN
C( C#N)
CC1 =C
CC#N )
N 2
N =C(
C( C=O)
C( C)
N# CC1
N =CN1
CN1 C=N
CN (
C1 2
=N N1
) C=O
N C=N
N C2
CC N1
C# C
O C2
C =CN
C =CN1
O CC1
NC(=O) C1
CC1=C( N)
O N=C1
O =CN1
=N 1
NC1 2
O CC
C1 C#N
C=N 1
C O1
C( F)
N1 )C#N
C =CC(=O)
C NC(=O)
C1 =N
CC1 =CC(=O)
CC( O)
C=C1 N
C2 =C1
CC( C#N)
N=C 2
C1 =CN
=O) =O
OC1 =O
CC( C)
) N(
O C(=O)N1
C(=O) N
CC1 C#N
C(N) =O
C=C1 C#N
C(=O) O1
N1 C=N
C2 C3
N( C=O)
)N( =O)=O
O )C#N
O=C1 CC2
CN1 N=N
O1 )C#N
CN 2
O 2
CNC1 =CC(=O)
C=C 2
O C=O)
C2 =N
OC1 2
CO C(=O)
C O)
CN1 C=C(
C(=N 1
CNC1 =N
O=C1 CC
CC#N )C#N
C=C C1=O
N1 C=O
NC1 =O
C# CC#N
O=C1O CC2
C C(=O)N1
N C3
O =C(
C2 C#N
C2 CC2
N# CC
O=C OC1
CN( C=O)
C( =CN1
CO C=O
O=CC1 =CN
N C=C1
O =CN
CN1 CC
CC( N)
N=N N1
NC1=N C(=O)
CC# CC#N
N C=O
C( CC#N)
OC1 C2
CNC1 =C
CC1( C)
OC(=O) N=C1
C(C=O) =C1
CC(C) (
) C1=O
N N=N
C( =C1
C(=O) C1
N1 )C=O
NC1 C#N
C2 =C(
C=N C1=O
O1 )
C) C(=O)
N# CC#
CC1=N C(=O)
O=C1N CC2
N =CN
N C=O)
O C(=N)
C(=O) N=C1
CC1 CC
CC1 C2
OC1 =CN
CN1 C=CC(=O)
CNC1 =C(
O=CC1 =C
) C#C
N )C#N
O C=C1
CC C2
O=C1 C=C
O=C1 C=CN
CNC1 =CN
CCN1 C=N
C(=CN1 )C#N
C )C#N
O N=N1
C1 (
C( OC=O)
CN1 C=C
NC(=O) N1
CC(=O) C1
COC1 =O
NC1=C( C=O)
NN=N 2
( C=O)
O C=O
C1 )
=C C1=O
=N O1
CC1 1
=C( N)
N=C1 O
C(N) =N
N=C O1
O=C1N CC
O=C1N C2
NC1=CN =C(
N=C( N)
CN( C)
N(C=O) C=O
C(=N1 )C#N
C(=C1 )C#N
O C3
=C1 C#N
OC(=O) O1
N#CC1 C2
O=CN1 CC
C(F) =N
N=C2 N1
N C(=N)
C( C1
C=N C(=O)N1
CC2 NC12
CNC1 =O
N# CCC1
CC1( CC1
CC1( CN1
COC1 =C(
COC1 =CN
CC12 NC1
C(C) =O
CN1C=N C(=O)
( C#N)
( CN2
C#N )C#N
C2 3
OC1 =N
CC( CC#N)
C(=N N1)C#N
CO C=N
N=C1N CC2
NC1=CC(=O) C2
CC12 CC1
NC1=C( N)
NC=N 1
) N1
2 N=N
C N=C1N
N C(C#N)
O N=C1N
O CC(=O)
CC C(=O)
CC O1
CC N2
O) N1
N# CC1=N
C(=N) N1
F) C(=O)
O=C1O CC
O=C1O C2
C(F) =C1
C1=CN =NN1
N1C=N N=C1
( CC2
C( =C
=N N=N1
C2 NC2
OC1 (
CN1 N=C(
CC( CO)
C#N) N1
CNC1 C#N
C=C O1
C(=N) O1
C# C)
COC1 =C
C(C=O) =N1
C(=O)N C=O
C2C3 NC3
( C#N)C#N
2 C=N
N C(
C1 =C
C1 )C=O
C1 NC2
=O) C#N
CC 3
CC1 CC(=O)
N1 2
C2 =CN
=C( N1)C=O
C=N N1
C=N C(=O)O1
N=C1 2
N=C1 C#N
N=C1 C=O
C=C1 )C#N
CCC1 =CN
COC1 2
C3 NC3
O=CC1 =N
CC# CC(=O)
C(C=O) =NN1
C(C) (
N#CC1 N
OCC1 =CC(=O)
N1C=N N=N1
N=CN 2
CCC2 =N1
( CO
O C=N
O CC1(
O CC1=N
O C(C#N)
O CC1=C
C1 CC#N
C( C)C#N
CC C#N
CC O)
CC C1=O
C(=O) C=C1
CC1 NC1
CC1 CO
CC1 OC(=O)
CC1 CNC(=O)
CC1 COC(=O)
N=C1 C=CN
CN1 C(=O)
CC( =N
N=N O2
C#N) C(=O)
CNC1 2
C=C NC1=O
C(=N) N=CN1
NC1=N C2=C(
N=C1N =CN
COC1 =N
NC1=C C(=N)
C=C( F)
C(O) =CN1
CC1=CN =NN1
NC1=CN C(=O)
N2 N=N
N=C( C#N)N1
N=CN1 2
N=CN1 )C#N
O=CN1 CC2
C2=C1 NN=N2
CC(C#N) C1
N=C2 O1
CN2 C1=O
C=C2 N
O=C( C#N)
O=CN C(=O)
C(C=O)=C1 N
CC(C)( O)
CC1(CN1 )
2 CCN2
C1 C2
=C O1
CC CC1
CC OC1=O
C(=O) CC#N
C(=O) C=CN1
CC1 CC1
CC1 CN(C=O)
=C1 N
=C1 C=O
C2 =O
OC1 CC1
OC1 CC2
O=C1 C2C3
CN1 2
CN1 C=O
C=C1 C=O
N# CC12
N# CC1=CN
C(=N) N=C1
C(=N) N1C=O
CCC1 =C
CCC1 =N
CCC1 C#N
CC1=C( O)
CC1=C( C)
C(N) =C1
C(N) C1(
O=C1N C=C
CC12 C#N
C=C( N)
CC1=CN =C(
C(C#N) C1C#N
N=C( F)
N#CC1 NC2
CN1C=N N=C1
NC=N 2
NC=N C1=N
OC2 =O
C=CN1 )C#N
CC1=C(N) N
C(=O)N C=C1
C2=N O
N#CCC1 (
(CN2 )C1=O
3 C#N
C NC(=O)C1
N CC1
N CC(
N C(N)=O
C1 C=O
CC N(
C(=O) C#N
C(=O) C=C2N
CC1 CC#N
CC1 NC(=O)
N1 )
=C1 O
C2 O1
C2 NC12
C=N N1C=O
N=C1 )C#N
N=C1 OCC
O=C1 C2
O1 )C=O
O1 )N(=O)=O
CC( C2
C) N1
NC(=O) NC=O
CC2 OC12
CO C=O)
CO CC#N
O=C C#
O=C OCC1
C(=O)N1 C=O
C(=N) OC1
CC1( CC#N)
CCC1 =CC(=O)
C3 OC3
NC1=C C(N)
OC(=O) C=C1
OC(=O) C=C1N
C=C( O)
O=C1O N=C2
O=CC1 2
NC1=C( O)
NC1=C( F)C(=O)
C(O) C1
C(O) CC#N
NC1=CN =NN1
CC#N) C#C
C(C=O) =CN1
=NN1 2
NC2 C1=O
CCN1 2
CCN1 C=O
OC2 =N
O=CN1 C2
CC(O) CC#N
C1=CN C=N1
C(=N1 )C#C
CNC1=N C(=O)
CC(=O)N1 C=O
CN(C=O) C=O
NN=N2 )N1
=C(N) N1
N=C(N) O1
C2C3NC3 C12
( =O)
( CO)
( CC#N)C#N
) O1
) C1C#N
) CO1
2 CCC2=N1
3 )
N CC#N
N C=CC1=O
O C(
O =N
C1 CC1
C1 CO
C1 NC=N
C1 C2C#N
C1 NC1C#N
C( CC#N)C#N
C( O1)
CC =O
CC C#
CC C2=C1
CC =CC1=O
CC1 C(
N1 C=C
N1 )N(=O)=O
C2 C1=O
C2 OC12
OC1 =C
OC1 =CC(=O)
C=N OC1=O
N=C1 C=C
O=C1 CCC1
CN1 )C#N
CN1 C(N)
CN1 C(C)
CN1 C=CN
CC( CC
CC( OC=O)
=CC(=O) N1
=CC(=O) C1=O
C=O) N=CN1
C=C1 C
C(=N O1)C#N
CO C(
CO )C#N
CO C(=O)N1
CO C(C)
O=C O
CC1( C#N)
NC1=N C(=N)
NC1=N C(O)
NC1=N C(C#N)
CCC1 =C(
N=C1N C2
N=C1N C=N
CC(=O) CC#N
COC1 C#N
COC1 CC#N
CC1=N C(=N)
CC1=N NC=N1
CC1=C( C)C(=O)
C(N) =O)C#N
N=C C=C1
N=C NC1=N
NC1=C C=C(
OC(=O) C12
N=N1 )C#N
F) C(=N)
CC# CC#CC#N
CC1=CN C=N1
CC1=CN (C=O)
N2 )C#N
N2 CC12
N=C( O)N1
C(C) =O)
CN1C=N N=N1
=NN1 C=O
NC=N C12
CCN1 C=CC(=O)
OC2 CC12
C=CN =C1C#N
OCC1 O
O=CN1 C2CC2
C(F) =CN1
CC(C#N) C1=O
CC(C#N) C12
C1=CN =NN=N1
C(=O)N C(N)=O
C2C3 OC3
COC(=O) OC1
CN1C=C( C=O)
C(=N1 )N(=O)=O
O=C( CC#N)
N=NN1 2
C2=C( NN=N2)N1
NC=O) C#N
CC1(CC1 )
CC1(CN1 )C#N
CC(=N )
C(N)C1( O)C#N
N=C(F) N1
O=N (=O)
F C1=CN
N C=C1C#N
N C(CC#N)
O CC1=C(
O C=C1N
O C(C=O)=C1N
C1 )C#N
C1 CN1
C1 CO1
C1 OC2=O
C( N)C#N
=O) C=O
CC CC#N
CC NC1=O
CC N(C=O)C=O
C(=O) C1=O
C(=O) N2
C(=O) N=CN1
C(=O) ON=C1
C(=O) C=C1N
CC1 )
CC1 CN1
CC1 CN
CC1 C(C)
CC1 CN(
CC1 CO1
CC1 CC(C#N)
CC1 CC(N)
N1 C=CN
=C1 N=CN2
NC1 C2
C2 =N1
C2 CC1C2
=C( N1)C#N
=C( O1)C#N
=C( C)N1
OC1 =C(
OC1 CN2
OC1 CC11
C=N N2
C=N C1=N
C=N O2
O=C1 C2NC2
CC( C=O)
CC( CN
CC( N1)C#N
CC( O)C#N
CC( CC#N)C#N
CC( O1)
CC( C1)
N=N N2
N=N N1)C#N
NC(=O) N
NC(=O) C=C1
NC(=O) NC(=O)
NC(=O) CN
C(=N C=C1)C#N
C(=N N1)N(=O)=O
N# CC1=C
O=C NC1=CN
C(=N) C1=O
CC1( N)
CC1( O)
CC1( O)C#N
CC1( CC#N)C#N
CC1( N)C#N
NC1=N OC(=O)
NC1=N C(C=O)
NC1=N C(F)=N
NC1=N C2=NO
CCC1 2
CCC1 CC#N
CC1=N C(=O)N
C(N) =CN1
C(N) =N1
NC1=CC(=O) NC1
NC1=CC(=O) OC1
N=C OC1
NC1=C C=N
NC1=C OC(=O)N1
NC1=C C(N)=N
NC1=C C(F)=N
N( C1)C=O
O=C1N C2CC2
C=C( C=O)
C=C( O)N1
O=CC1 (
NC1=C( NC=O)
C(O) =NN1
CC# C
CC# CC(O)
CC1=CN C(=O)
CC1=CN C(=O)N=C1
NC1=CN =N
NC1=CN (C=O)
C(C#N) C1
C(C#N) C12
CC1=C C(N)=N
N=C( O)
N#CC1 CC
N#CC1 OCC
CN1C=N C(=N)
CN( CC
CN( C(C)=O)
CCN1 C=C
C#C )C#N
OC2 C1=O
C=CN 2
ON=C1 )C=O
O=CN1 C=C
OCC =C1
C=N1 )C#N
CO1 )
C(F) =N1
CNC(=O) C1=O
CNC(=O) C12
C1=N NC=C1
C2=C1 NC=N2
C=C2 N1
CN1C=C( C)
CC(=O)N1 2
C(=CN1 )N(=O)=O
OC1C2 NC2
C(C=O)=C1 C
N#CC# CC1
OC(=N) N=C1N
O=CC1=C 2CCN2
O=C1C=C C2
CCN1C=N N=C1
CCN1C=N N=N1
C(OC=O) =NN1
=C(N) O1
N=C(N) N1
NC(=N) C(=O)
NC(C#N) C1
(CC2 )C1=O
C(=C O1)C#N
OC1( CC#N)
C2=CN =NN12
N#CC1N CC2
(CO 2
CC(C2 )C1=O
C=C(O) O1
OC2=N N=CN12
C(O1) C2C#N
( C)
) C1
1 CC1
1 NC1C#N
2 NC=N
C N)
F C1
N CC
O =CC(=O)
O CC#N
O C=C1C#N
O C(CC#N)
O C=NC1=O
O CC2NC12
O CC(CO)
O CC#CC(=O)
O C(N)=C1
C1 3C#N
C( O)C#N
C( CO)
=O) C(N)=O
=N N=C1
=N N2
CC O
CC C(
CC C(=O)N1
CC C(C)
CC CO1
CC OC(=O)N1
CC N(C=O)
CC OC=O
C(=O) CC1
C(=O) NC1
C(=O) N=N1
C(=O) C12
C(=O) C#C
C(=O) C2C#N
CC1 N
CC1 =O
CC1 C(O)
CC1 C=CC(=O)
CC1 CN2
CC1 O2
CC1 C#CC#N
N1 CC1
N1 C=C2
=C1 C
NC1 (
NC1 CC#N
C2 (
C2 1
C2 O
C2 N1
C2 C(=O)N1
C2 CC12
C2 CNC12
=C( O1)
=C( O1)C=O
=CN =C1C#N
=CN =C1C=O
OC1 CC
OC1 C#N
OC1 C=O
OC1 C(O)C1
C=N )
N=C1 CC2
N=C1 OC2
O=C1 CN
O=C1 CC(=O)
O=C1 N=C
CN1 )
CC( N
CC( N2
CC( N)C#N
CC( C#C)
CC( COC=O)
CC( C1)C#N
=CC(=O) O1
C=C1 2
C=C1 F
C=C1 O
C=C1 C#C
NC(=O) N=C1
NC(=O) C1=O
NC(=O) C(O)
NC(=O) C#C
CC2 C1=O
CO CC(=O)
CO C2C1=O
C#N) C1=O
C=C NC1=N
C=C C=N1
N# CC1=C(
CN C=N
CN =C(N)
O=C CN=C1N
NC1=N C=C(
NC1=N OC(=O)N1
NC1=N OC(=O)N=C1
C# C)C(=O)
CCC1 (
CCC1 )C#N
N=C1N )C#N
CC(=O) C1=O
CC(=O) C(=O)N1
CC(=O) C1C#N
CC(=O) OC12
CC(=O) NC=O
COC1 C(=O)
COC1 =CC(=O)
CC1=N OC(=O)
CC1=N C(C#N)
CC1=N C(C=O)
CC1=N OC(=O)N1
CC1=N NC=C1
CC1=N ON=C1N
CC1=C( C=O)
CC1=C( C#N)C(=O)
NC1=CC(=O) O
NC1=CC(=O) ON=C1
N=C OCC
N=C O1)C#N
NC1=C OC(=O)
NC1=C C(O)
NC1=C C(C=O)
NC1=C OC(=O)N=C1
N( C)
N( =O)=O
OC(=O) C1=O
O=C1N C(=C
CC12 OC(=O)
C=C( N1)C#N
C=C( O1)C#N
C=C( N1)C=O
O=C1O C2C3
O=CC1 C2
NC1=C( F)
NC1=C( C#C)C(=O)
C(O) =N1
C(O) (C#N)C#N
C(O) =CO1
CC1=CN C=C1
NC1=CN =NO1
C(C#N) C(N)=O
C(C#N) N1C=O
C(C#N) =C1N
C(C#N) =C1C
CC1=C OC(=O)N=C1
N2 C=N
N=C( O1)C#N
N=C( N1)C=O
C(C=O) C#N
C(C) =C1
N#CC1 OC2
N=CN1 CC2
CN1C=N C(=O)N=C1
CN1C=N C(=N)N=C1
NC2 C#N
NC2 C1C#N
OC2 C1C#N
C=CN1 2
NC(=O)C1 (
ON=C1 C#N
NC12 C3
CO1 )C#N
C=CC(=O) C1=O
CNC(=O) N1
CC(O) C1
CC(C#N) C1C#N
N=C2 O
OC(=O)N1 C
N1C=N C2=N
N(C=O) N=N1
O=C1CC2 CC1(
CN1N=N C=C1
CN1N=N C(=N)
CN1N=N N=N1
CN1N=N C(=O)C=C1
O2 )C#N
C=C2 CCN12
C2=N N=CN12
C2=N N=NN12
COC(=O) C1
COC(=O) C12
CN1C=C( N)
CNC1=N C(=N)
O=C1CC C2
O=C( C#C)
O=COC1 (
CN(C=O) C1=O
O=CC1=CN CC
NC=C1 C=O
O=CN (
CC(N) =O
CC(N) =CC1=O
N=NN1 )C#C
OC1C2 3
CC(C)( C)
C(=C1 )N(=O)=O
C2=C( O1)
N#CC# CC1=C
N=CN C(=O)
CC1C2 C1
CNC1=C( C=O)
CNC1=C( C)C(=O)
OC=C1 2
OC=C1 O
CCC2 C1=O
O=C1C=CN 2
C(OC=O) =CN1
N=C1O CC2
NC1=CN=C( C=O)
NC1=CN=C( F)
C(F)=N C1=O
C(C1 CO1)
COC1=C( C=O)
CC(CC#N) O1
2N=N OC2
2N=N N=C2N1
2N=N N=C12
NC(C#N) C12
OCC(=O) CC#N
C2NC2 C1=O
CN1N=C( C=O)
2C=N N=C2N1
2C=N N=C12
C1NC2 1
C2=CN =NN2
C(C)( CC#N)C#N
(CO )C#N
OC=N )
NC1=NC2=C( C1)
N2N=N N=C2N1
CCCC1 =O
CC1=C(O) N
C=C(N) N1
N1) N=NO2
N1C=C C2=N
CN1C(N) =C
F)C(=N) C=CN1
N#CC1=C 2CCN2
CC1(O)C#N )C#N
C2C(=O)N1 3
C2=CN=NN2 C1
( =O)=O
( C#C)C#N
2 CC2
C N=C1
F C1=N
N 3
N =CC(=O)
