{"<pad>":0,"<s>":1,"</s>":2,"<unk>":3,"#":4,"(":5,")":6,"*":7,"+":8,"-":9,".":10,"/":11,"0":12,"1":13,"2":14,"3":15,"4":16,"5":17,"6":18,"7":19,"8":20,"9":21,":":22,"=":23,"@":24,"A":25,"B":26,"C":27,"D":28,"E":29,"F":30,"G":31,"H":32,"I":33,"K":34,"L":35,"M":36,"N":37,"O":38,"P":39,"R":40,"S":41,"T":42,"U":43,"V":44,"W":45,"X":46,"Y":47,"Z":48,"[":49,"\\":50,"]":51,"a":52,"b":53,"c":54,"d":55,"e":56,"f":57,"g":58,"h":59,"i":60,"k":61,"l":62,"m":63,"n":64,"o":65,"p":66,"r":67,"s":68,"t":69,"u":70,"v":71,"w":72,"x":73,"y":74,"z":75,"C1":76,"C(":77,"=O":78,"=C":79,"=O)":80,"=N":81,"CC":82,"C(=O)":83,"CC1":84,"N1":85,"#N":86,"=C1":87,"NC1":88,"C#N":89,"C2":90,"=C(":91,"=CN":92,"OC1":93,"C=N":94,")C#N":95,"N=C1":96,"O=C1":97,"CN1":98,"C=O":99,"O1":100,"CC(":101,"=CC(=O)":102,"C=O)":103,"CC#N":104,"N)":105,"N=N":106,"C=C1":107,"O)":108,"=CN1":109,"C1=O":110,"C)":111,"NC(=O)":112,"CC2":113,"C(=N":114,"CO":115,"C#N)":116,"CNC1":117,"C=C":118,"N#":119,"CN":120,"O=C":121,"C(=O)N1":122,"C(=N)":123,"CC1(":124,"NC1=N":125,"C#":126,"CCC1":127,"N=C1N":128,"CC(=O)":129,"COC1":130,"CC1=N":131,"CC1=C(":132,"C(N)":133,"NC1=CC(=O)":134,"C3":135,"N=C":136,"NC1=C":137,"N(":138,"OC(=O)":139,"O=C1N":140,"N=N1":141,"F)":142,"CC12":143,"C=C(":144,"O=C1O":145,"O=CC1":146,"NC1=C(":147,"C(O)":148,"CC#":149,"CC1=CN":150,"NC1=CN":151,"C(C#N)":152,"CC1=C":153,"CC#N)":154,"N2":155,"N=C(":156,"C(C=O)":157,"C(C)":158,"N#CC1":159,"N=CN1":160,"CN1C=N":161,"CN(":162,"C12":163,"=NN1":164,")C=O":165,"NC=N":166,"NC2":167,"CCN1":168,"C#C":169,"OC2":170,"C=CN":171,"C=CN1":172,"OCC1":173,"NC(=O)C1":174,"CC1=C(N)":175,"ON=C1":176,"O=CN1":177,"=N1":178,"NC12":179,"OCC":180,"C1C#N":181,"C=N1":182,"CO1":183,"C(F)":184,"N1)C#N":185,"C=CC(=O)":186,"CNC(=O)":187,"C1=N":188,"CC1=CC(=O)":189,"CC(O)":190,"C=C1N":191,"C2=C1":192,"CC(C#N)":193,"N=C2":194,"C1=CN":195,"=O)=O":196,"OC1=O":197,"CC(C)":198,")N(":199,"OC(=O)N1":200,"C(=O)N":201,"CC1C#N":202,"C(N)=O":203,"C=C1C#N":204,"C(=O)O1":205,"N1C=N":206,"C2C3":207,"N(C=O)":208,")N(=O)=O":209,"O)C#N":210,"O=C1CC2":211,"CN1N=N":212,"O1)C#N":213,"CN2":214,"O2":215,"CNC1=CC(=O)":216,"C=C2":217,"OC=O)":218,"C2=N":219,"OC12":220,"COC(=O)":221,"CO)":222,"CN1C=C(":223,"C(=N1":224,"CNC1=N":225,"O=C1CC":226,"CC#N)C#N":227,"C=CC1=O":228,"N1C=O":229,"NC1=O":230,"C#CC#N":231,"O=C1OCC2":232,"CC(=O)N1":233,"NC3":234,"O=C(":235,"C2C#N":236,"C2CC2":237,"N#CC":238,"O=COC1":239,"CN(C=O)":240,"C(=CN1":241,"COC=O":242,"O=CC1=CN":243,"NC=C1":244,"O=CN":245,"CN1CC":246,"CC(N)":247,"N=NN1":248,"NC1=NC(=O)":249,"CC#CC#N":250,"NC=O":251,"C(CC#N)":252,"OC1C2":253,"CNC1=C":254,"CC1(C)":255,"OC(=O)N=C1":256,"C(C=O)=C1":257,"CC(C)(":258,")C1=O":259,"NN=N":260,"C(=C1":261,"C(=O)C1":262,"N1)C=O":263,"NC1C#N":264,"C2=C(":265,"C=NC1=O":266,"O1)":267,"C)C(=O)":268,"N#CC#":269,"CC1=NC(=O)":270,"O=C1NCC2":271,"N=CN":272,"NC=O)":273,"OC(=N)":274,"C(=O)N=C1":275,"CC1CC":276,"CC1C2":277,"OC1=CN":278,"CN1C=CC(=O)":279,"CNC1=C(":280,"O=CC1=C":281,")C#C":282,"N)C#N":283,"OC=C1":284,"CCC2":285,"O=C1C=C":286,"O=C1C=CN":287,"CNC1=CN":288,"CCN1C=N":289,"C(=CN1)C#N":290,"C)C#N":291,"ON=N1":292,"C1(":293,"C(OC=O)":294,"CN1C=C":295,"NC(=O)N1":296,"CC(=O)C1":297,"COC1=O":298,"NC1=C(C=O)":299,"NN=N2":300,"(C=O)":301,"OC=O":302,"C1)":303,"=CC1=O":304,"=NO1":305,"CC11":306,"=C(N)":307,"N=C1O":308,"C(N)=N":309,"N=CO1":310,"O=C1NCC":311,"O=C1NC2":312,"NC1=CN=C(":313,"N=C(N)":314,"CN(C)":315,"N(C=O)C=O":316,"C(=N1)C#N":317,"C(=C1)C#N":318,"OC3":319,"=C1C#N":320,"OC(=O)O1":321,"N#CC1C2":322,"O=CN1CC":323,"C(F)=N":324,"N=C2N1":325,"NC(=N)":326,"C(C1":327,"C=NC(=O)N1":328,"CC2NC12":329,"CNC1=O":330,"N#CCC1":331,"CC1(CC1":332,"CC1(CN1":333,"COC1=C(":334,"COC1=CN":335,"CC12NC1":336,"C(C)=O":337,"CN1C=NC(=O)":338,"(C#N)":339,"(CN2":340,"C#N)C#N":341,"C23":342,"OC1=N":343,"CC(CC#N)":344,"C(=NN1)C#N":345,"COC=N":346,"N=C1NCC2":347,"NC1=CC(=O)C2":348,"CC12CC1":349,"NC1=C(N)":350,"NC=N1":351,")N1":352,"2N=N":353,"CN=C1N":354,"NC(C#N)":355,"ON=C1N":356,"OCC(=O)":357,"CCC(=O)":358,"CCO1":359,"CCN2":360,"O)N1":361,"N#CC1=N":362,"C(=N)N1":363,"F)C(=O)":364,"O=C1OCC":365,"O=C1OC2":366,"C(F)=C1":367,"C1=CN=NN1":368,"N1C=NN=C1":369,"(CC2":370,"C(=C":371,"=NN=N1":372,"C2NC2":373,"OC1(":374,"CN1N=C(":375,"CC(CO)":376,"C#N)N1":377,"CNC1C#N":378,"C=CO1":379,"C(=N)O1":380,"C#C)":381,"COC1=C":382,"C(C=O)=N1":383,"C(=O)NC=O":384,"C2C3NC3":385,"(C#N)C#N":386,"2C=N":387,"NC(":388,"C1=C":389,"C1)C=O":390,"C1NC2":391,"=O)C#N":392,"CC3":393,"CC1CC(=O)":394,"N12":395,"C2=CN":396,"=C(N1)C=O":397,"C=NN1":398,"C=NC(=O)O1":399,"N=C12":400,"N=C1C#N":401,"N=C1C=O":402,"C=C1)C#N":403,"CCC1=CN":404,"COC12":405,"C3NC3":406,"O=CC1=N":407,"CC#CC(=O)":408,"C(C=O)=NN1":409,"C(C)(":410,"N#CC1N":411,"OCC1=CC(=O)":412,"N1C=NN=N1":413,"N=CN2":414,"CCC2=N1":415,"(CO":416,"OC=N":417,"OCC1(":418,"OCC1=N":419,"OC(C#N)":420,"OCC1=C":421,"C1CC#N":422,"C(C)C#N":423,"CCC#N":424,"CCO)":425,"CCC1=O":426,"C(=O)C=C1":427,"CC1NC1":428,"CC1CO":429,"CC1OC(=O)":430,"CC1CNC(=O)":431,"CC1COC(=O)":432,"N=C1C=CN":433,"CN1C(=O)":434,"CC(=N":435,"N=NO2":436,"C#N)C(=O)":437,"CNC12":438,"C=CNC1=O":439,"C(=N)N=CN1":440,"NC1=NC2=C(":441,"N=C1N=CN":442,"COC1=N":443,"NC1=CC(=N)":444,"C=C(F)":445,"C(O)=CN1":446,"CC1=CN=NN1":447,"NC1=CNC(=O)":448,"N2N=N":449,"N=C(C#N)N1":450,"N=CN12":451,"N=CN1)C#N":452,"O=CN1CC2":453,"C2=C1NN=N2":454,"CC(C#N)C1":455,"N=C2O1":456,"CN2C1=O":457,"C=C2N":458,"O=C(C#N)":459,"O=CNC(=O)":460,"C(C=O)=C1N":461,"CC(C)(O)":462,"CC1(CN1)":463,"2CCN2":464,"C1C2":465,"=CO1":466,"CCCC1":467,"CCOC1=O":468,"C(=O)CC#N":469,"C(=O)C=CN1":470,"CC1CC1":471,"CC1CN(C=O)":472,"=C1N":473,"=C1C=O":474,"C2=O":475,"OC1CC1":476,"OC1CC2":477,"O=C1C2C3":478,"CN12":479,"CN1C=O":480,"C=C1C=O":481,"N#CC12":482,"N#CC1=CN":483,"C(=N)N=C1":484,"C(=N)N1C=O":485,"CCC1=C":486,"CCC1=N":487,"CCC1C#N":488,"CC1=C(O)":489,"CC1=C(C)":490,"C(N)=C1":491,"C(N)C1(":492,"O=C1NC=C":493,"CC12C#N":494,"C=C(N)":495,"CC1=CN=C(":496,"C(C#N)C1C#N":497,"N=C(F)":498,"N#CC1NC2":499,"CN1C=NN=C1":500,"NC=N2":501,"NC=NC1=N":502,"OC2=O":503,"C=CN1)C#N":504,"CC1=C(N)N":505,"C(=O)NC=C1":506,"C2=NO":507,"N#CCC1(":508,"(CN2)C1=O":509,"3C#N":510,"CNC(=O)C1":511,"NCC1":512,"NCC(":513,"NC(N)=O":514,"C1C=O":515,"CCN(":516,"C(=O)C#N":517,"C(=O)C=C2N":518,"CC1CC#N":519,"CC1NC(=O)":520,"N1)":521,"=C1O":522,"C2O1":523,"C2NC12":524,"C=NN1C=O":525,"N=C1)C#N":526,"N=C1OCC":527,"O=C1C2":528,"O1)C=O":529,"O1)N(=O)=O":530,"CC(C2":531,"C)N1":532,"NC(=O)NC=O":533,"CC2OC12":534,"COC=O)":535,"COCC#N":536,"O=CC#":537,"O=COCC1":538,"C(=O)N1C=O":539,"C(=N)OC1":540,"CC1(CC#N)":541,"CCC1=CC(=O)":542,"C3OC3":543,"NC1=CC(N)":544,"OC(=O)C=C1":545,"OC(=O)C=C1N":546,"C=C(O)":547,"O=C1ON=C2":548,"O=CC12":549,"NC1=C(O)":550,"NC1=C(F)C(=O)":551,"C(O)C1":552,"C(O)CC#N":553,"NC1=CN=NN1":554,"CC#N)C#C":555,"C(C=O)=CN1":556,"=NN12":557,"NC2C1=O":558,"CCN12":559,"CCN1C=O":560,"OC2=N":561,"O=CN1C2":562,"CC(O)CC#N":563,"C1=CNC=N1":564,"C(=N1)C#C":565,"CNC1=NC(=O)":566,"CC(=O)N1C=O":567,"CN(C=O)C=O":568,"NN=N2)N1":569,"=C(N)N1":570,"N=C(N)O1":571,"C2C3NC3C12":572,"(=O)":573,"(CO)":574,"(CC#N)C#N":575,")O1":576,")C1C#N":577,")CO1":578,"2CCC2=N1":579,"3)":580,"NCC#N":581,"NC=CC1=O":582,"OC(":583,"O=N":584,"C1CC1":585,"C1CO":586,"C1NC=N":587,"C1C2C#N":588,"C1NC1C#N":589,"C(CC#N)C#N":590,"C(O1)":591,"CC=O":592,"CCC#":593,"CCC2=C1":594,"CC=CC1=O":595,"CC1C(":596,"N1C=C":597,"N1)N(=O)=O":598,"C2C1=O":599,"C2OC12":600,"OC1=C":601,"OC1=CC(=O)":602,"C=NOC1=O":603,"N=C1C=C":604,"O=C1CCC1":605,"CN1)C#N":606,"CN1C(N)":607,"CN1C(C)":608,"CN1C=CN":609,"CC(CC":610,"CC(OC=O)":611,"=CC(=O)N1":612,"=CC(=O)C1=O":613,"C=O)N=CN1":614,"C=C1C":615,"C(=NO1)C#N":616,"COC(":617,"CO)C#N":618,"COC(=O)N1":619,"COC(C)":620,"O=CO":621,"CC1(C#N)":622,"NC1=NC(=N)":623,"NC1=NC(O)":624,"NC1=NC(C#N)":625,"CCC1=C(":626,"N=C1NC2":627,"N=C1NC=N":628,"CC(=O)CC#N":629,"COC1C#N":630,"COC1CC#N":631,"CC1=NC(=N)":632,"CC1=NNC=N1":633,"CC1=C(C)C(=O)":634,"C(N)=O)C#N":635,"N=CC=C1":636,"N=CNC1=N":637,"NC1=CC=C(":638,"OC(=O)C12":639,"N=N1)C#N":640,"F)C(=N)":641,"CC#CC#CC#N":642,"CC1=CNC=N1":643,"CC1=CN(C=O)":644,"N2)C#N":645,"N2CC12":646,"N=C(O)N1":647,"C(C)=O)":648,"CN1C=NN=N1":649,"=NN1C=O":650,"NC=NC12":651,"CCN1C=CC(=O)":652,"OC2CC12":653,"C=CN=C1C#N":654,"OCC1O":655,"O=CN1C2CC2":656,"C(F)=CN1":657,"CC(C#N)C1=O":658,"CC(C#N)C12":659,"C1=CN=NN=N1":660,"C(=O)NC(N)=O":661,"C2C3OC3":662,"COC(=O)OC1":663,"CN1C=C(C=O)":664,"C(=N1)N(=O)=O":665,"O=C(CC#N)":666,"N=NN12":667,"C2=C(NN=N2)N1":668,"NC=O)C#N":669,"CC1(CC1)":670,"CC1(CN1)C#N":671,"CC(=N)":672,"C(N)C1(O)C#N":673,"N=C(F)N1":674,"O=N(=O)":675,"FC1=CN":676,"NC=C1C#N":677,"NC(CC#N)":678,"OCC1=C(":679,"OC=C1N":680,"OC(C=O)=C1N":681,"C1)C#N":682,"C1CN1":683,"C1CO1":684,"C1OC2=O":685,"C(N)C#N":686,"=O)C=O":687,"CCCC#N":688,"CCNC1=O":689,"CCN(C=O)C=O":690,"C(=O)C1=O":691,"C(=O)N2":692,"C(=O)N=CN1":693,"C(=O)ON=C1":694,"C(=O)C=C1N":695,"CC1)":696,"CC1CN1":697,"CC1CN":698,"CC1C(C)":699,"CC1CN(":700,"CC1CO1":701,"CC1CC(C#N)":702,"CC1CC(N)":703,"N1C=CN":704,"=C1N=CN2":705,"NC1C2":706,"C2=N1":707,"C2CC1C2":708,"=C(N1)C#N":709,"=C(O1)C#N":710,"=C(C)N1":711,"OC1=C(":712,"OC1CN2":713,"OC1CC11":714,"C=NN2":715,"C=NC1=N":716,"C=NO2":717,"O=C1C2NC2":718,"CC(C=O)":719,"CC(CN":720,"CC(N1)C#N":721,"CC(O)C#N":722,"CC(CC#N)C#N":723,"CC(O1)":724,"CC(C1)":725,"N=NN2":726,"N=NN1)C#N":727,"NC(=O)N":728,"NC(=O)C=C1":729,"NC(=O)NC(=O)":730,"NC(=O)CN":731,"C(=NC=C1)C#N":732,"C(=NN1)N(=O)=O":733,"N#CC1=C":734,"O=CNC1=CN":735,"C(=N)C1=O":736,"CC1(N)":737,"CC1(O)":738,"CC1(O)C#N":739,"CC1(CC#N)C#N":740,"CC1(N)C#N":741,"NC1=NOC(=O)":742,"NC1=NC(C=O)":743,"NC1=NC(F)=N":744,"NC1=NC2=NO":745,"CCC12":746,"CCC1CC#N":747,"CC1=NC(=O)N":748,"C(N)=CN1":749,"C(N)=N1":750,"NC1=CC(=O)NC1":751,"NC1=CC(=O)OC1":752,"N=COC1":753,"NC1=CC=N":754,"NC1=COC(=O)N1":755,"NC1=CC(N)=N":756,"NC1=CC(F)=N":757,"N(C1)C=O":758,"O=C1NC2CC2":759,"C=C(C=O)":760,"C=C(O)N1":761,"O=CC1(":762,"NC1=C(NC=O)":763,"C(O)=NN1":764,"CC#C":765,"CC#CC(O)":766,"CC1=CNC(=O)":767,"CC1=CNC(=O)N=C1":768,"NC1=CN=N":769,"NC1=CN(C=O)":770,"C(C#N)C1":771,"C(C#N)C12":772,"CC1=CC(N)=N":773,"N=C(O)":774,"N#CC1CC":775,"N#CC1OCC":776,"CN1C=NC(=N)":777,"CN(CC":778,"CN(C(C)=O)":779,"CCN1C=C":780,"C#C)C#N":781,"OC2C1=O":782,"C=CN2":783,"ON=C1)C=O":784,"O=CN1C=C":785,"OCC=C1":786,"C=N1)C#N":787,"CO1)":788,"C(F)=N1":789,"CNC(=O)C1=O":790,"CNC(=O)C12":791,"C1=NNC=C1":792,"C2=C1NC=N2":793,"C=C2N1":794,"CN1C=C(C)":795,"CC(=O)N12":796,"C(=CN1)N(=O)=O":797,"OC1C2NC2":798,"C(C=O)=C1C":799,"N#CC#CC1":800,"OC(=N)N=C1N":801,"O=CC1=C2CCN2":802,"O=C1C=CC2":803,"CCN1C=NN=C1":804,"CCN1C=NN=N1":805,"C(OC=O)=NN1":806,"=C(N)O1":807,"N=C(N)N1":808,"NC(=N)C(=O)":809,"NC(C#N)C1":810,"(CC2)C1=O":811,"C(=CO1)C#N":812,"OC1(CC#N)":813,"C2=CN=NN12":814,"N#CC1NCC2":815,"(CO2":816,"CC(C2)C1=O":817,"C=C(O)O1":818,"OC2=NN=CN12":819,"C(O1)C2C#N":820,"(C)":821,")C1":822,"1CC1":823,"1NC1C#N":824,"2NC=N":825,"CN)":826,"FC1":827,"NCC":828,"O=CC(=O)":829,"OCC#N":830,"OC=C1C#N":831,"OC(CC#N)":832,"OC=NC1=O":833,"OCC2NC12":834,"OCC(CO)":835,"OCC#CC(=O)":836,"OC(N)=C1":837,"C13C#N":838,"C(O)C#N":839,"C(CO)":840,"=O)C(N)=O":841,"=NN=C1":842,"=NN2":843,"CCO":844,"CCC(":845,"CCC(=O)N1":846,"CCC(C)":847,"CCCO1":848,"CCOC(=O)N1":849,"CCN(C=O)":850,"CCOC=O":851,"C(=O)CC1":852,"C(=O)NC1":853,"C(=O)N=N1":854,"C(=O)C12":855,"C(=O)C#C":856,"C(=O)C2C#N":857,"CC1N":858,"CC1=O":859,"CC1C(O)":860,"CC1C=CC(=O)":861,"CC1CN2":862,"CC1O2":863,"CC1C#CC#N":864,"N1CC1":865,"N1C=C2":866,"=C1C":867,"NC1(":868,"NC1CC#N":869,"C2(":870,"C21":871,"C2O":872,"C2N1":873,"C2C(=O)N1":874,"C2CC12":875,"C2CNC12":876,"=C(O1)":877,"=C(O1)C=O":878,"=CN=C1C#N":879,"=CN=C1C=O":880,"OC1CC":881,"OC1C#N":882,"OC1C=O":883,"OC1C(O)C1":884,"C=N)":885,"N=C1CC2":886,"N=C1OC2":887,"O=C1CN":888,"O=C1CC(=O)":889,"O=C1N=C":890,"CN1)":891,"CC(N":892,"CC(N2":893,"CC(N)C#N":894,"CC(C#C)":895,"CC(COC=O)":896,"CC(C1)C#N":897,"=CC(=O)O1":898,"C=C12":899,"C=C1F":900,"C=C1O":901,"C=C1C#C":902,"NC(=O)N=C1":903,"NC(=O)C1=O":904,"NC(=O)C(O)":905,"NC(=O)C#C":906,"CC2C1=O":907,"COCC(=O)":908,"COC2C1=O":909,"C#N)C1=O":910,"C=CNC1=N":911,"C=CC=N1":912,"N#CC1=C(":913,"CNC=N":914,"CN=C(N)":915,"O=CCN=C1N":916,"NC1=NC=C(":917,"NC1=NOC(=O)N1":918,"NC1=NOC(=O)N=C1":919,"C#C)C(=O)":920,"CCC1(":921,"CCC1)C#N":922,"N=C1N)C#N":923,"CC(=O)C1=O":924,"CC(=O)C(=O)N1":925,"CC(=O)C1C#N":926,"CC(=O)OC12":927,"CC(=O)NC=O":928,"COC1C(=O)":929,"COC1=CC(=O)":930,"CC1=NOC(=O)":931,"CC1=NC(C#N)":932,"CC1=NC(C=O)":933,"CC1=NOC(=O)N1":934,"CC1=NNC=C1":935,"CC1=NON=C1N":936,"CC1=C(C=O)":937,"CC1=C(C#N)C(=O)":938,"NC1=CC(=O)O":939,"NC1=CC(=O)ON=C1":940,"N=COCC":941,"N=CO1)C#N":942,"NC1=COC(=O)":943,"NC1=CC(O)":944,"NC1=CC(C=O)":945,"NC1=COC(=O)N=C1":946,"N(C)":947,"N(=O)=O":948,"OC(=O)C1=O":949,"O=C1NC(=C":950,"CC12OC(=O)":951,"C=C(N1)C#N":952,"C=C(O1)C#N":953,"C=C(N1)C=O":954,"O=C1OC2C3":955,"O=CC1C2":956,"NC1=C(F)":957,"NC1=C(C#C)C(=O)":958,"C(O)=N1":959,"C(O)(C#N)C#N":960,"C(O)=CO1":961,"CC1=CNC=C1":962,"NC1=CN=NO1":963,"C(C#N)C(N)=O":964,"C(C#N)N1C=O":965,"C(C#N)=C1N":966,"C(C#N)=C1C":967,"CC1=COC(=O)N=C1":968,"N2C=N":969,"N=C(O1)C#N":970,"N=C(N1)C=O":971,"C(C=O)C#N":972,"C(C)=C1":973,"N#CC1OC2":974,"N=CN1CC2":975,"CN1C=NC(=O)N=C1":976,"CN1C=NC(=N)N=C1":977,"NC2C#N":978,"NC2C1C#N":979,"OC2C1C#N":980,"C=CN12":981,"NC(=O)C1(":982,"ON=C1C#N":983,"NC12C3":984,"CO1)C#N":985,"C=CC(=O)C1=O":986,"CNC(=O)N1":987,"CC(O)C1":988,"CC(C#N)C1C#N":989,"N=C2O":990,"OC(=O)N1C":991,"N1C=NC2=N":992,"N(C=O)N=N1":993,"O=C1CC2CC1(":994,"CN1N=NC=C1":995,"CN1N=NC(=N)":996,"CN1N=NN=N1":997,"CN1N=NC(=O)C=C1":998,"O2)C#N":999,"C=C2CCN12":1000,"C2=NN=CN12":1001,"C2=NN=NN12":1002,"COC(=O)C1":1003,"COC(=O)C12":1004,"CN1C=C(N)":1005,"CNC1=NC(=N)":1006,"O=C1CCC2":1007,"O=C(C#C)":1008,"O=COC1(":1009,"CN(C=O)C1=O":1010,"O=CC1=CNCC":1011,"NC=C1C=O":1012,"O=CN(":1013,"CC(N)=O":1014,"CC(N)=CC1=O":1015,"N=NN1)C#C":1016,"OC1C23":1017,"CC(C)(C)":1018,"C(=C1)N(=O)=O":1019,"C2=C(O1)":1020,"N#CC#CC1=C":1021,"N=CNC(=O)":1022,"CC1C2C1":1023,"CNC1=C(C=O)":1024,"CNC1=C(C)C(=O)":1025,"OC=C12":1026,"OC=C1O":1027,"CCC2C1=O":1028,"O=C1C=CN2":1029,"C(OC=O)=CN1":1030,"N=C1OCC2":1031,"NC1=CN=C(C=O)":1032,"NC1=CN=C(F)":1033,"C(F)=NC1=O":1034,"C(C1CO1)":1035,"COC1=C(C=O)":1036,"CC(CC#N)O1":1037,"2N=NOC2":1038,"2N=NN=C2N1":1039,"2N=NN=C12":1040,"NC(C#N)C12":1041,"OCC(=O)CC#N":1042,"C2NC2C1=O":1043,"CN1N=C(C=O)":1044,"2C=NN=C2N1":1045,"2C=NN=C12":1046,"C1NC21":1047,"C2=CN=NN2":1048,"C(C)(CC#N)C#N":1049,"(CO)C#N":1050,"OC=N)":1051,"NC1=NC2=C(C1)":1052,"N2N=NN=C2N1":1053,"CCCC1=O":1054,"CC1=C(O)N":1055,"C=C(N)N1":1056,"N1)N=NO2":1057,"N1C=CC2=N":1058,"CN1C(N)=C":1059,"F)C(=N)C=CN1":1060,"N#CC1=C2CCN2":1061,"CC1(O)C#N)C#N":1062,"C2C(=O)N13":1063,"C2=CN=NN2C1":1064,"(=O)=O":1065,"(C#C)C#N":1066,"2CC2":1067,"CN=C1":1068,"FC1=N":1069,"N3":1070,"N=CC(=O)":1071}